Библиотека_электронных_документов_демо/src/Documents/_ДемоУстановкаЦенНоменклатуры/_ДемоУстановкаЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>_ДемоУстановкаЦенНоменклатуры</name>
  <registerRecords>InformationRegister._ДемоЦеныНоменклатуры</registerRecords>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef._ДемоВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Библиотека_электронных_документов_демо/src/Enums/ВидыЭД/ВидыЭД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЭД</name>
  <enumValues>
    <name>АктВыполненныхРабот</name>
  </enumValues>
  <enumValues>
    <name>АктЗаказчик</name>
  </enumValues>
  <enumValues>
    <name>АктИсполнитель</name>
  </enumValues>
  <enumValues>
    <name>АктНаПередачуПрав</name>
  </enumValues>
  <enumValues>
    <name>ВозвратТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>ДопДанные</name>
  </enumValues>
  <enumValues>
    <name>ЗаказТовара</name>
  </enumValues>
  <enumValues>
    <name>ИзвещениеОПолучении</name>
  </enumValues>
  <enumValues>
    <name>КаталогТоваров</name>
  </enumValues>
  <enumValues>
    <name>КорректировочныйСчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ОтветНаЗаказ</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОПродажахКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>ОтчетОСписанииКомиссионногоТовара</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>ПередачаТоваровМеждуОрганизациями</name>
  </enumValues>
  <enumValues>
    <name>Подтверждение</name>
  </enumValues>
  <enumValues>
    <name>ПрайсЛист</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеОбАннулировании</name>
  </enumValues>
  <enumValues>
    <name>ПроизвольныйЭД</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиОтправитель</name>
  </enumValues>
  <enumValues>
    <name>СоглашениеОбИзмененииСтоимостиПолучатель</name>
  </enumValues>
  <enumValues>
    <name>СчетНаОплату</name>
  </enumValues>
  <enumValues>
    <name>СчетФактура</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ12Продавец</name>
  </enumValues>
  <enumValues>
    <name>УведомлениеОбУточнении</name>
  </enumValues>
  <enumValues>
    <name>УдалитьВыпискаБанка</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросЗонд</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНаОтзывЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросНочнойВыписки</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЗапросОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьИзвещениеОСостоянииЭД</name>
  </enumValues>
  <enumValues>
    <name>УдалитьКвитанция</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеПоручение</name>
  </enumValues>
  <enumValues>
    <name>УдалитьПлатежноеТребование</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУКД_ИнформацияПродавца</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПокупателя</name>
  </enumValues>
  <enumValues>
    <name>УдалитьУПД_ИнформацияПродавца</name>
  </enumValues>
</mdclass:Enum>

Библиотека_электронных_документов_демо/src/Documents/_ДемоУстановкаЦенНоменклатуры/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВыгрузитьВФайл(Команда)
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ВыгрузитьВФайлЗавершить", ЭтотОбъект);
	ОткрытьФорму("Справочник.Организации.ФормаВыбора", ,,,,,ОбработчикОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузитьВФайлЗавершить(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресТаблицыЦен = ЦеныНоменклатуры();
	
	СтруктураЭД = Новый Структура;
	СтруктураЭД.Вставить("ВидЭД", ПредопределенноеЗначение("Перечисление.ВидыЭД.ПрайсЛист"));
	СтруктураЭД.Вставить("АдресТаблицыЦен", АдресТаблицыЦен);
	СтруктураЭД.Вставить("ДатаФормирования", Объект.Дата);
	СтруктураЭД.Вставить("ВладелецЭД", Результат);
	СтруктураЭД.Вставить("ТипЭлементаВерсииЭД", 
		ПредопределенноеЗначение("Перечисление.ТипыЭлементовВерсииЭД.ПервичныйЭД"));
	СтруктураЭД.Вставить("Организация", Результат);
	
	ПараметрыЭД = Новый Структура("ВыгрузитьВФайл", СтруктураЭД);
	
	ОбменСКонтрагентамиКлиент.СформироватьФайлБыстрогоОбмена(ПараметрыЭД);
	
КонецПроцедуры

&НаСервере
Функция ЦеныНоменклатуры()
	
	ЦеныНоменклатуры = ТаблицаЦен();
	
	ЦеныДокумента = РеквизитФормыВЗначение("Объект").Товары;
	Для Каждого ТекСтрока Из ЦеныДокумента Цикл
		НоваяСтрока = ЦеныНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		НоваяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекСтрока.Номенклатура,"ЕдиницаИзмерения");
	КонецЦикла;
	
	ВидЦены = РеквизитФормыВЗначение("Объект").ВидЦены;
	ЦеныНоменклатуры.ЗаполнитьЗначения(ВидЦены, "ТипЦены");
	
	АдресЦенНоменклатуры = ПоместитьВоВременноеХранилище(ЦеныНоменклатуры, Новый УникальныйИдентификатор);
	
	Возврат АдресЦенНоменклатуры;
	
КонецФункции

&НаСервере
Функция ТаблицаЦен()
	
	ТаблицаЦен = Новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Номенклатура");
	ТаблицаЦен.Колонки.Добавить("Характеристика");
	ТаблицаЦен.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаЦен.Колонки.Добавить("Количество");
	ТаблицаЦен.Колонки.Добавить("ТипЦены");
	ТаблицаЦен.Колонки.Добавить("Цена");
	
	Возврат ТаблицаЦен;
	
КонецФункции

#КонецОбласти
